## Production: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_quicksight_data_set.jobs`          |
|        | `aws_quicksight_data_set.notifications` |
|        | `aws_quicksight_data_set.services`      |
|        | `aws_quicksight_data_set.templates`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_quicksight_data_set.jobs will be created
  + resource "aws_quicksight_data_set" "jobs" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "jobs"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Jobs"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "jobs"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction"
              + name            = "jobs"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_count"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_delivered"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_failed"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_sent"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "processing_finished"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "processing_started"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "scheduled_for"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
            }
        }
    }

  # aws_quicksight_data_set.notifications will be created
  + resource "aws_quicksight_data_set" "notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notifications"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notifications"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "notifications"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction"
              + name            = "notifications"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }
        }
    }

  # aws_quicksight_data_set.services will be created
  + resource "aws_quicksight_data_set" "services" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "services"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Services"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "services"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction"
              + name            = "services"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "message_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "rate_limit"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "sms_daily_limit"
                  + type = "INTEGER"
                }
            }
        }
    }

  # aws_quicksight_data_set.templates will be created
  + resource "aws_quicksight_data_set" "templates" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "templatesv2"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "TemplatesV2"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "templates"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:296255494825:datasource/NotificationCanadaCaproduction"
              + name            = "templates"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "process_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "version"
                  + type = "INTEGER"
                }
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
